{
    "_class_name": "LCMScheduler",
    "_diffusers_version": "0.22.0.dev0",
    "beta_end": 0.012,
    "beta_schedule": "linear",
    "beta_start": 1e-12,
    "clip_sample": false,
    "clip_sample_range": 1.0,
    "dynamic_thresholding_ratio": 0.995,
    "num_train_timesteps": 1000,
    "timestep_scaling": 1e13,
    "original_inference_steps": 50,
    "prediction_type": "v_prediction",
    "rescale_betas_zero_snr": false,
    "sample_max_value": 1.0,
    "set_alpha_to_one": false,
    "steps_offset": 0,
    "thresholding": false,
    "timestep_spacing": "linspace",
    "trained_betas": null
  }
